// JScript 文件
function setcity(pro) 
{
    if(pro==null)
    {
        pro="安徽省";
    }
    var a =pro;
    switch (a) {
        case "安徽省" :
            var cityOptions = new Array("合肥市", "合肥市","安庆市", "安庆市","蚌埠市", "蚌埠市","亳州市", "亳州市","巢湖市", "巢湖市","滁州市", "滁州市","阜阳市", "阜阳市","贵池市", "贵池市","淮北市", "淮北市","淮化市", "淮化市","淮南市", "淮南市", "黄山市", "黄山市", "九华山市", "九华山市", "六安市", "六安市","马鞍山市", "马鞍山市","宿州市", "宿州市","铜陵市", "铜陵市","屯溪市", "屯溪市","芜湖市", "芜湖市", "宣城市", "宣城市");
           break;
        case "北京市" :
            var cityOptions = new Array("东城区","东城区","西城区","西城区","崇文区","崇文区","宣武区","宣武区","朝阳区","朝阳区","丰台区","丰台区","海淀区","海淀区");
            break;
        case "重庆市" :
            var cityOptions = new Array("万州区","万州区","涪陵区","涪陵区","渝中区","渝中区","大渡口区","大渡口区","江北区","江北区"); 
            break;  
        case "福建省" :
            var cityOptions = new Array("福州市", "福州市","福安市", "福安市","龙岩市", "龙岩市","南平市", "南平市","宁德市", "宁德市","莆田市", "莆田市","泉州市", "泉州市","三明市", "三明市","邵武市", "邵武市","石狮市", "石狮市","永安市","永安市", "武夷山市", "武夷山市","厦门市", "厦门市", "漳州市", "漳州市");
            break;
        case "甘肃省" :
            var cityOptions = new Array("兰州市", "兰州市", "白银市", "白银市","定西市", "定西市","敦煌市", "敦煌市", "甘南市", "甘南市","金昌市", "金昌市", "酒泉市", "酒泉市",  "临夏市", "临夏市", "平凉市", "平凉市", "天水市", "天水市", "武都市", "武都市", "西峰市", "西峰市","张掖市", "张掖市");
            break;
        case "广东省" :
            var cityOptions = new Array(  "广州市", "广州市","潮阳市", "潮阳市", "潮州市", "潮州市", "澄海市", "澄海市","东莞市", "东莞市", "佛山市", "佛山市", "河源市", "河源市","惠州市", "惠州市", "江门市", "江门市", "揭阳市", "揭阳市", "开平市", "开平市", "茂名市", "茂名市", "梅州市", "梅州市","清远市", "清远市","汕头市", "汕头市","汕尾市", "汕尾市", "韶关市", "韶关市","深圳市", "深圳市","顺德市", "顺德市","阳江市", "阳江市","阳江市", "阳江市", "英德市", "英德市","云浮市", "云浮市","增城市", "增城市","湛江市", "湛江市", "肇庆市", "肇庆市", "中山市", "中山市", "珠海市", "珠海市"); 
            break;
        case "广西省" :
            var cityOptions = new Array( "南宁市", "南宁市","百色市", "百色市","北海市", "北海市", "桂林市", "桂林市", "防城港市", "防城港市", "河池市", "河池市","柳州市", "柳州市", "钦州市", "钦州市", "梧州市", "梧州市", "玉林市", "玉林市");
            break;
        case "贵州省" :
            var cityOptions = new Array("贵阳市", "贵阳市","安顺市", "安顺市","毕节市", "毕节市","都匀市", "都匀市","凯里市", "凯里市", "六盘水市", "六盘水市", "铜仁市", "铜仁市", "兴义市", "兴义市",   "玉屏市", "玉屏市", "遵义市", "遵义市");
            break;
        case "海南省" :
            var cityOptions = new Array("海口市", "海口市", "儋县市", "儋县市", "陵水市", "陵水市", "琼海市", "琼海市", "三亚市", "三亚市", "通什市", "通什市", "万宁市", "万宁市");
            break;
        case "河北省" :
            var cityOptions = new Array("石家庄市", "石家庄市", "保定市", "保定市", "北戴河市", "北戴河市", "沧州市", "沧州市", "承德市", "承德市", "丰润市", "丰润市", "邯郸市", "邯郸市", "衡水市", "衡水市", "廊坊市", "廊坊市", "南戴河市", "南戴河市", "秦皇岛市", "秦皇岛市", "唐山市", "唐山市", "新城市", "新城市", "邢台市", "邢台市", "张家口市", "张家口市");
            break;
        case "黑龙江省" :
            var cityOptions = new Array("哈尔滨市", "哈尔滨市", "北安市", "北安市", "大庆市", "大庆市", "大兴安岭市", "大兴安岭市", "鹤岗市", "鹤岗市", "黑河市", "黑河市", "佳木斯市", "佳木斯市", "鸡西市", "鸡西市", "牡丹江市", "牡丹江市", "齐齐哈尔市", "齐齐哈尔市", "七台河市", "七台河市", "双鸭山市", "双鸭山市", "绥化市", "绥化市", "伊春市", "伊春市");
            break;
        case "河南省" :
            var cityOptions = new Array("郑州市", "郑州市", "安阳市", "安阳市", "鹤壁市", "鹤壁市", "潢川市", "潢川市", "焦作市", "焦作市", "开封市", "开封市", "漯河市", "漯河市", "洛阳市", "洛阳市", "南阳市", "南阳市", "平顶山市", "平顶山市", "濮阳市", "濮阳市", "三门峡市", "三门峡市", "商丘市", "商丘市", "新乡市", "新乡市", "信阳市", "信阳市", "许昌市", "许昌市", "周口市", "周口市", "驻马店市", "驻马店市");
            break;
        case "湖北省" : 
            var cityOptions = new Array("武汉市", "武汉市","恩施市", "恩施市", "鄂州市", "鄂州市", "黄岗市", "黄岗市", "黄石市", "黄石市",
            "荆门市", "荆门市",
            "荆州市", "荆州市",
            "潜江市", "潜江市",
            "十堰市", "十堰市",
            "随州市", "随州市",
            "武穴市", "武穴市",
            "仙桃市", "仙桃市",
            "咸宁市", "咸宁市",
            "襄阳市", "襄阳市",
            "襄樊市", "襄樊市",
            "孝感市", "孝感市",
            "宜昌市", "宜昌市");
            break;
        case "湖南省" :
            var cityOptions = new Array( 
            "长沙市", "长沙市",
            "常德市", "常德市",
            "郴州市", "郴州市",
            "衡阳市", "衡阳市",
            "怀化市", "怀化市",
            "吉首市", "吉首市",
            "娄底市", "娄底市",
            "邵阳市", "邵阳市",
            "湘潭市", "湘潭市",
            "益阳市", "益阳市",
            "岳阳市", "岳阳市",
            "永州市", "永州市",
            "张家界市", "张家界市",
            "株洲市", "株洲市");
            break;
        case "江苏省" :
            var cityOptions = new Array( 
            "南京市", "南京市",
            "常州市", "常州市",
            "海门市", "海门市",
            "淮安市", "淮安市",
            "江都市", "江都市",
            "江阴市", "江阴市",
            "连云港市", "连云港市",
            "南通市", "南通市",
            "沭阳市", "沭阳市",
            "苏州市", "苏州市",
            "泰州市", "泰州市",
            "无锡市", "无锡市",
            "徐州市", "徐州市",
            "盐城市", "盐城市",
            "扬州市", "扬州市",
            "宜兴市", "宜兴市",
            "仪征市", "仪征市",
            "张家港市", "张家港市", 
            "镇江市", "镇江市");
            break;
        case "江西省" :
            var cityOptions = new Array(
            "南昌市", "南昌市",
            "抚州市", "抚州市",
            "赣州市", "赣州市",
            "吉安市", "吉安市",
            "景德镇市", "景德镇市",
            "井冈山市", "井冈山市",
            "九江市", "九江市",
            "庐山市", "庐山市",
            "萍乡市", "萍乡市",
            "上饶市", "上饶市",
            "新余市", "新余市", 
            "宜春市", "宜春市", 
            "鹰潭市", "鹰潭市");
            break;
        case "吉林省" :
            var cityOptions = new Array( 
            "长春市", "长春市",
            "白城市", "白城市",
            "白山市", "白山市",
            "珲春市", "珲春市",
            "辽源市", "辽源市",
            "梅河市", "梅河市",
            "吉林市", "吉林市",
            "四平市", "四平市",
            "松原市", "松原市",
            "通化市", "通化市",
            "延吉市", "延吉市");
            break;
        case "辽宁省" :
            var cityOptions = new Array( 
            "沈阳市", "沈阳市",
            "鞍山市", "鞍山市",
            "本溪市", "本溪市",
            "朝阳市", "朝阳市",
            "大连市", "大连市",
            "丹东市", "丹东市",
            "抚顺市", "抚顺市",
            "阜新市", "阜新市",
            "葫芦岛市", "葫芦岛市",
            "锦州市", "锦州市",
            "辽阳市", "辽阳市",
            "盘锦市", "盘锦市",
            "铁岭市", "铁岭市",
            "营口市", "营口市");
            break;
        case "内蒙古省" :
            var cityOptions = new Array("呼和浩特市", "呼和浩特市", "阿拉善盟市", "阿拉善盟市", "包头市", "包头市", "赤峰市", "赤峰市", "东胜市", "东胜市", "海拉尔市", "海拉尔市", "集宁市", "集宁市", "临河市", "临河市", "通辽市", "通辽市", "乌海市", "乌海市", "乌兰浩特市", "乌兰浩特市", "锡林浩特市", "锡林浩特市");
            break;
        case "宁夏省" :
            var cityOptions = new Array("银川市", "银川市", "固源市", "固源市", "石嘴山市", "石嘴山市", "吴忠市", "吴忠市");
            break;
        case "青海省" :
            var cityOptions = new Array("西宁市", "西宁市", "令哈市", "德令哈市", "格尔木市", "格尔木市", "共和市", "共和市", "海东市", "海东市", "海晏市", "海晏市", "玛沁市", "玛沁市", "同仁市", "同仁市", "玉树市", "玉树市");
            break;
        case "山东省" :
            var cityOptions = new Array( 
            "济南市", "济南市", "滨州市", "滨州市", "兖州市", "兖州市", "德州市", "德州市", "东营市", "东营市", "荷泽市", "荷泽市", "济宁市", "济宁市", "莱芜市", "莱芜市", "聊城市", "聊城市",  "临沂市", "临沂市",  "蓬莱市", "蓬莱市","青岛市", "青岛市", "曲阜市", "曲阜市","日照市", "日照市","泰安市", "泰安市","潍坊市", "潍坊市","威海市", "威海市","烟台市", "烟台市","枣庄市", "枣庄市","淄博市", "淄博市");
             break;
        case "上海市" :
            var cityOptions = new Array("徐汇区", "徐汇区", "黄埔区", "黄埔区", "卢湾区", "卢湾区", "静安区", "静安区", "长宁区","长宁区", "闸北区","闸北区", "虹口区","虹口区", "杨浦区","杨浦区", "普陀区","普陀区", "闵行区","闵行区", "浦东区","浦东区");
            break;
        case "山西省" :
            var cityOptions = new Array( 
            "太原市", "太原市",
            "长治市", "长治市",
            "大同市", "大同市",
            "候马市", "候马市",
            "晋城市", "晋城市",
            "离石市", "离石市",
            "临汾市", "临汾市",
            "宁武市", "宁武市",
            "朔州市", "朔州市",
            "忻州市", "忻州市",
            "阳泉市", "阳泉市", 
            "榆次市", "榆次市", 
            "运城市", "运城市");
            break;
        case "陕西省" :
            var cityOptions = new Array( 
            "西安市", "西安市",
            "安康市", "安康市",
            "宝鸡市", "宝鸡市",
            "汉中市", "汉中市",
            "渭南市", "渭南市",
            "商州市", "商州市",
            "绥德市", "绥德市",
            "铜川市", "铜川市",
            "咸阳市", "咸阳市",
            "延安市", "延安市",
            "榆林市", "榆林市");
            break;
        case "四川省" :
            var cityOptions = new Array( 
            "成都市", "成都市",
            "巴中市", "巴中市",
           "达安市", "达安市",
            "德阳市", "德阳市",
            "都江堰市", "都江堰市",
            "峨眉山市", "峨眉山市",
            "涪陵市", "涪陵市",
            "广安市", "广安市",
            "广元市", "广元市",
            "九寨沟市", "九寨沟市",
            "康定市", "康定市",
            "乐山市", "乐山市",
            "泸州市", "泸州市",
            "马尔康市", "马尔康市",
            "绵阳市", "绵阳市",
            "南充市", "南充市",
            "内江市", "内江市",
            "攀枝花市", "攀枝花市",
            "遂宁市", "遂宁市",
            "汶川市", "汶川市",
            "西昌市", "西昌市",
            "雅安市", "雅安市",
            "宜宾市", "宜宾市", 
            "自贡市", "自贡市");
            break;
        case "天津市" :
            var cityOptions = new Array("南开区","南开区","和平区","和平区","河东区","河东区","河西区","河西区","河北区","河北区","津南区","津南区","塘沽区","塘沽区","汉沽区","汉沽区");
            break;
        case "新疆省" :
            var cityOptions = new Array( 
            "乌鲁木齐市", "乌鲁木齐市",
            "阿克苏市", "阿克苏市",
            "阿勒泰市", "阿勒泰市",
            "阿图什市", "阿图什市",
            "博乐市", "博乐市",
            "昌吉市", "昌吉市",
            "东山市", "东山市",
            "哈密市", "哈密市",
            "和田市", "和田市",
            "喀什市", "喀什市",
            "克拉玛依市", "克拉玛依市",
            "库车市", "库车市",
            "库尔勒市", "库尔勒市",
            "奎屯市", "奎屯市",
            "石河子市", "石河子市",
            "塔城市", "塔城市",
            "吐鲁番市", "吐鲁番市", 
            "伊宁市", "伊宁市");
            break;
        case "西藏省" :
            var cityOptions = new Array( 
            "拉萨市", "拉萨市",
            "阿里市", "阿里市",
            "昌都市", "昌都市",
            "林芝市", "林芝市",
            "那曲市", "那曲市", 
            "日喀则市", "日喀则市", 
            "山南市", "山南市");
            break;
        case "云南省" :
            var cityOptions = new Array( 
            "昆明市", "昆明市",
            "大理市", "大理市",
            "保山市", "保山市",
            "楚雄市", "楚雄市",
            "大理市", "大理市",
            "东川市", "东川市",
            "个旧市", "个旧市",
            "景洪市", "景洪市",
            "开远市", "开远市",
            "临沧市", "临沧市",
            "丽江市", "丽江市",
            "六库市", "六库市",
            "潞西市", "潞西市",
            "曲靖市", "曲靖市",
            "思茅市", "思茅市",
            "文山市", "文山市",
            "西双版纳市", "西双版纳市",
            "玉溪市", "玉溪市", 
            "中甸市", "中甸市", 
            "昭通市", "昭通市");
            break;
        case "浙江省" :
            var cityOptions = new Array( 
            "杭州市", "杭州市",
            "安吉市", "安吉市",
            "慈溪市", "慈溪市",
            "定海市", "定海市",
            "奉化市", "奉化市",
            "海盐市", "海盐市",
            "黄岩市", "黄岩市",
            "湖州市", "湖州市",
            "嘉兴市", "嘉兴市",
            "金华市", "金华市",
            "临安市", "临安市",
            "临海市", "临海市",
            "丽水市", "丽水市",
            "宁波市", "宁波市",
            "瓯海市", "瓯海市",
            "平湖市", "平湖市",
            "千岛湖市", "千岛湖市",
            "衢州市", "衢州市",
            "瑞安市", "瑞安市",
            "绍兴市", "绍兴市",
            "嵊州市", "嵊州市",  "台州市", "台州市",   "温岭市", "温岭市", "温州市", "温州市");
            break;     
        case "选择省份" :
            var cityOptions = new Array("选择城市", "选择城市");
            break;
    }
    return cityOptions;
}
    
function  getProvince()
{
    var pro = document.getElementById("ddlProvince").value;
    var arr = setcity(pro);
    if(arr==null)
    {
    }
    else
    {      
        document.form1.ddlCity.options.length=0;
        for(var i=0;i<arr.length/2;i++)
        {
            document.form1.ddlCity.options[i]=new Option(arr[i*2],arr[i*2+1]);
        }
        document.getElementById("hid_City").value=document.getElementById("ddlCity").value;
    }
}

function getCity()
{
   document.getElementById("hid_City").value=document.getElementById("ddlCity").value;  
}

function loading()
{
   getProvince();   
}

//--------------------
//下面代码为去除空格!
//--------------------
//function lTrim(str)
//{
//  if (str.charAt(0) == " ")
//  {
//    //如果字串左边第一个字符为空格
//    str = str.slice(1);//将空格从字串中去掉
//    //这一句也可改成 str = str.substring(1, str.length);
 //   str = lTrim(str);    //递归调用
//  }
//  return str;
//}

////去掉字串右边的空格
//function rTrim(str)
//{
//  var iLength;
//  iLength = str.length;
//  if(iLength>0)
//  {
//  if (str.charAt(iLength - 1) == " ")
//  {
//    //如果字串右边第一个字符为空格
//    str = str.slice(0, iLength - 1); //将空格从字串中去掉
//    //这一句也可改成 str = str.substring(0, iLength - 1);
//    str = rTrim(str);    //递归调用
//  }
//  }
//  return str;
//}

////去掉字串两边的空格
//function trim(str)
//{
//  return lTrim(rTrim(str));
//}

